# 서문 {-}

과학자, 분석가, 컨설턴트 또는 기술 문서나 보고서를 준비해야 하는 다른 모든 사람이라면 가장 중요한 기술 중 하나는 설득력 있는 데이터 시각화, 일반적으로 그림 형태를 만드는 능력입니다. 그림은 일반적으로 주장의 무게를 지닙니다. 명확하고 매력적이며 설득력이 있어야 합니다. 좋은 그림과 나쁜 그림의 차이는 매우 영향력 있는 논문과 무명 논문, 수주 또는 수주 실패, 면접 성공 또는 실패의 차이일 수 있습니다. 그럼에도 불구하고 설득력 있는 데이터 시각화를 만드는 방법을 가르쳐주는 자료는 놀라울 정도로 적습니다. 이 주제에 대한 과정을 제공하는 대학은 거의 없으며 이 주제에 대한 책도 많지 않습니다. (물론 일부는 존재합니다.) 플로팅 소프트웨어에 대한 튜토리얼은 일반적으로 특정 시각적 효과를 달성하는 방법에 초점을 맞추고 특정 선택이 선호되고 다른 선택이 선호되지 않는 이유를 설명하지 않습니다. 일상 업무에서 단순히 좋은 그림을 만드는 방법을 알고 있을 것으로 예상되며 운이 좋으면 첫 과학 논문을 작성할 때 몇 가지 요령을 가르쳐주는 인내심 있는 조언자가 있을 것입니다.

글쓰기의 맥락에서 숙련된 편집자는 "귀"에 대해 이야기합니다. 즉, 글이 좋은지 여부를 (산문을 읽을 때 내부적으로) 들을 수 있는 능력입니다. 저는 그림과 기타 시각화의 경우에도 마찬가지로 "눈"이 필요하다고 생각합니다. 즉, 그림을 보고 균형이 잡히고 명확하며 설득력이 있는지 볼 수 있는 능력입니다. 그리고 글쓰기의 경우와 마찬가지로 그림이 작동하는지 여부를 보는 능력은 배울 수 있습니다. 눈을 갖는다는 것은 주로 좋은 시각화의 간단한 규칙과 원칙 모음을 더 많이 알고 다른 사람들이 그렇지 않을 수 있는 작은 세부 사항에 주의를 기울인다는 것을 의미합니다.

제 경험상 글쓰기에서와 마찬가지로 주말에 책을 읽는다고 해서 눈이 뜨이는 것은 아닙니다. 평생 과정이며 오늘날 여러분에게 너무 복잡하거나 미묘한 개념이 5년 후에는 훨씬 더 의미가 있을 수 있습니다. 저 자신도 그림 준비에 대한 이해가 계속 발전하고 있다고 말할 수 있습니다. 저는 정기적으로 새로운 접근 방식에 노출되려고 노력하며 다른 사람들이 그림에서 내리는 시각적 및 디자인 선택에 주의를 기울입니다. 또한 마음을 바꿀 준비가 되어 있습니다. 오늘 특정 그림이 훌륭하다고 생각할 수 있지만 다음 달에는 비판할 이유를 찾을 수 있습니다. 따라서 이 점을 염두에 두고 제가 말하는 것을 절대적인 진리로 받아들이지 마십시오. 특정 선택에 대한 제 추론에 대해 비판적으로 생각하고 이를 채택할지 여부를 결정하십시오.

이 책의 자료는 논리적인 순서로 제시되지만 대부분의 장은 독립적으로 존재하며 책 전체를 읽을 필요는 없습니다. 자유롭게 건너뛰거나 현재 관심 있는 특정 섹션 또는 고민하고 있는 특정 디자인 선택을 다루는 섹션을 선택하십시오. 사실, 이 책을 한 번에 다 읽는 것보다 오랜 기간에 걸쳐 조금씩 읽고 책에서 몇 가지 개념만 그림 만들기에 적용한 다음 다른 개념에 대해 읽거나 얼마 전에 배운 개념을 다시 읽는 것이 이 책에서 가장 많은 것을 얻을 수 있다고 생각합니다. 몇 달이 지난 후 다시 읽으면 같은 장이 다른 것을 말해 줄 수 있다는 것을 알게 될 것입니다.

이 책의 거의 모든 그림이 R과 ggplot2로 만들어졌지만 저는 이 책을 R 책으로 보지 않습니다. 저는 그림 준비의 일반적인 원칙에 대해 이야기하고 있습니다. 그림을 만드는 데 사용된 소프트웨어는 부수적입니다. 제가 보여주는 종류의 그림을 생성하기 위해 원하는 모든 플로팅 소프트웨어를 사용할 수 있습니다. 그러나 ggplot2 및 유사한 패키지는 제가 사용하는 많은 기술을 다른 플로팅 라이브러리보다 훨씬 간단하게 만듭니다. 중요하게도 이것은 R 책이 아니므로 이 책 어디에도 코드나 프로그래밍 기술에 대해 논의하지 않습니다. 저는 여러분이 코드가 아니라 개념과 그림에 집중하기를 바랍니다. 특정 그림이 어떻게 만들어졌는지 궁금하다면 GitHub 저장소(https://github.com/clauswilke/dataviz)에서 책의 소스 코드를 확인할 수 있습니다.


## 그래프 소프트웨어 및 그림 준비 파이프라인에 대한 생각 {-}

저는 20년 이상 과학 출판물을 위한 그림을 준비한 경험이 있으며 수천 개의 그림을 만들었습니다. 이 20년 동안 변하지 않은 것이 있다면 그림 준비 파이프라인의 변화입니다. 몇 년마다 새로운 플로팅 라이브러리가 개발되거나 새로운 패러다임이 등장하고 많은 과학자들이 최신 도구 키트로 전환합니다. 저는 gnuplot, Xfig, Mathematica, Matlab, 파이썬의 matplotlib, 기본 R, R의 ggplot2, 그리고 현재 기억나지 않는 다른 것들을 사용하여 그림을 만들었습니다. 현재 제가 선호하는 접근 방식은 R의 ggplot2이지만 은퇴할 때까지 계속 사용할 것이라고는 생각하지 않습니다.

소프트웨어 플랫폼의 이러한 지속적인 변화는 이 책이 프로그래밍 책이 아니고 모든 코드 예제를 생략한 주요 이유 중 하나입니다. 저는 이 책이 어떤 소프트웨어를 사용하든 유용하기를 바라며 모든 사람이 ggplot2에서 벗어나 다음 새로운 것을 사용하게 된 후에도 가치가 있기를 바랍니다. 이 선택이 특정 그림을 어떻게 만들었는지 알고 싶어하는 일부 ggplot2 사용자에게는 실망스러울 수 있다는 것을 알고 있습니다. 그들에게 저는 책의 소스 코드를 읽으라고 말하고 싶습니다. 사용할 수 있습니다. 또한 앞으로 코드에만 초점을 맞춘 보충 문서를 출시할 수도 있습니다.

수년 동안 제가 배운 한 가지는 자동화가 친구라는 것입니다. 저는 그림이 데이터 분석 파이프라인(이것도 자동화되어야 함)의 일부로 자동 생성되어야 하며 수동 후처리 없이 프린터로 바로 보낼 수 있도록 파이프라인에서 나와야 한다고 생각합니다. 많은 연수생이 그림의 초안을 자동 생성한 다음 Illustrator로 가져와 다듬는 것을 많이 봅니다. 이것이 나쁜 생각인 데에는 몇 가지 이유가 있습니다. 첫째, 그림을 수동으로 편집하는 순간 최종 그림은 재현 불가능하게 됩니다. 제3자는 여러분이 만든 것과 똑같은 그림을 생성할 수 없습니다. 축 레이블의 글꼴만 변경했다면 별 문제가 되지 않을 수 있지만 경계가 모호하며 덜 명확한 영역으로 쉽게 넘어갈 수 있습니다. 예를 들어 암호 같은 레이블을 더 읽기 쉬운 레이블로 수동으로 바꾸고 싶다고 가정해 보겠습니다. 제3자는 레이블 교체가 적절했는지 확인할 수 없을 수 있습니다. 둘째, 그림 준비 파이프라인에 수동 후처리를 많이 추가하면 변경하거나 작업을 다시 수행하는 것을 더 꺼리게 됩니다. 따라서 공동 작업자나 동료가 제기한 합리적인 변경 요청을 무시하거나 실제로 모든 데이터를 다시 생성했음에도 불구하고 이전 그림을 재사용하고 싶은 유혹을 받을 수 있습니다. 이것은 꾸며낸 예가 아닙니다. 저는 실제 사람과 실제 논문에서 이러한 모든 일이 일어나는 것을 보았습니다. 셋째, 특정 그림을 준비하기 위해 정확히 무엇을 했는지 스스로 잊어버리거나 이전 그림과 시각적으로 정확히 일치하는 새 데이터에 대한 미래 그림을 생성하지 못할 수 있습니다.

위의 모든 이유로 대화형 플롯 프로그램은 나쁜 생각입니다. 본질적으로 그림을 수동으로 준비하도록 강요합니다. 사실 일부 대화형 플롯 프로그램에서 전체 그림을 손으로 만드는 것보다 그림 초안을 자동 생성하고 Illustrator에서 다듬는 것이 아마 더 나을 것입니다. Excel도 대화형 플롯 프로그램이며 그림 준비(또는 데이터 분석)에 권장되지 않는다는 점에 유의하십시오.

데이터 시각화에 관한 책에서 중요한 구성 요소 중 하나는 제안된 시각화의 실현 가능성입니다. 우아한 새로운 시각화 방법을 발명하는 것은 좋지만 아무도 이 시각화를 사용하여 쉽게 그림을 생성할 수 없다면 별 소용이 없습니다. 예를 들어 터프티가 처음 스파크라인을 제안했을 때 아무도 쉽게 만들 수 있는 방법이 없었습니다. 가능한 것의 한계를 뛰어넘어 세상을 발전시키는 선구자가 필요하지만 저는 이 책이 출판물을 위해 그림을 준비하는 현업 데이터 과학자에게 실용적이고 직접적으로 적용 가능하기를 바랍니다. 따라서 다음 장에서 제안하는 시각화는 ggplot2와 쉽게 구할 수 있는 확장 패키지를 통해 몇 줄의 R 코드로 생성할 수 있습니다. 사실 챕터 \@ref(no-3d), \@ref(image-file-formats), \@ref(choosing-visualization-software)의 몇 가지 그림을 제외하고 이 책의 거의 모든 그림은 표시된 대로 정확하게 자동 생성되었습니다.

## 감사의 말 {-}

이 프로젝트는 RStudio 팀이 R 세계를 일류 출판 플랫폼으로 만드는 데 쏟은 환상적인 노력 없이는 불가능했을 것입니다. 특히 이 책 전체의 모든 그림을 만드는 데 사용된 플로팅 소프트웨어인 **ggplot2**를 만들어준 해들리 위컴에게 감사드립니다. 또한 R 마크다운을 만들고 **knitr** 및 **bookdown** 패키지를 작성한 이회 시에게도 감사드립니다. 이러한 도구가 준비되어 있지 않았다면 이 프로젝트를 시작하지 않았을 것이라고 생각합니다. R 마크다운 파일을 작성하는 것은 재미있고 자료를 수집하고 추진력을 얻기가 쉽습니다. 아힘 자일라이스와 레토 슈타우퍼에게 **colorspace**, 토마스 린 페데르센에게 **ggforce** 및 **gganimate**, 카밀 슬로위코프스키에게 **ggrepel**, 에드저 페베스마에게 **sf**, 그리고 조립된 R 그림에서 색각 이상을 시뮬레이션하기 위한 **colorspace** 및 **colorblindr**에 대한 그녀의 작업에 대해 클레어 맥화이트에게 특별히 감사드립니다.

몇몇 분들이 이 책의 초고에 대해 유용한 피드백을 주셨습니다. 가장 중요한 것은 오라일리의 제 편집자인 마이크 루키데스와 스티브 해로즈가 모든 장을 읽고 논평해 주셨다는 것입니다. 또한 칼 버그스트롬, 제시카 헐먼, 매튜 케이, 에드저 페베스마, 트리스탄 마르, 존 슈와비시, 해들리 위컴으로부터 유용한 의견을 받았습니다. 렌 키퍼의 블로그와 키어런 힐리의 책 및 블로그 게시물은 만들 그림과 사용할 데이터 세트에 대한 수많은 영감을 제공했습니다. 티아고 아라이스, 맬컴 배럿, 제시카 버넷, 존 콜더, 안토니우 페드루 카마르구, 대런 카드, 킴 크레스만, 아코스 하이두, 앤드류 킨스만, 윌 코르센, 알렉스 랄레지니, 존 리들리, 카트린 라인웨버, 미켈 마디나, 클레어 맥화이트, 스부시소 음콘드와네, 호세 나자리오, 스티브 퍼트먼, 마엘 살몬, 크리스티안 슈도마, 제임스 스콧-브라운, 엔리코 스피넬리, 바우터르 판 데르 베일, 론 유르코를 포함한 많은 분들이 사소한 문제나 오타를 지적해 주셨습니다.

또한 tidyverse 및 R 커뮤니티 전체의 다른 모든 기여자들에게도 더 넓게 감사드립니다. 마주칠 수 있는 모든 시각화 문제에 대한 R 패키지가 정말로 있습니다. 이러한 모든 패키지는 수천 명의 데이터 과학자 및 통계학자로 구성된 광범위한 커뮤니티에 의해 개발되었으며 그중 많은 분들이 어떤 형태로든 이 책을 만드는 데 기여했습니다.
